{"backend": "theano", "keras_version": "2.1.6", "config": [{"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 200, 200, 3], "kernel_size": [3, 3], "name": "conv2d_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "valid", "use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "filters": 5, "dtype": "float32", "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "name": "conv2d_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "valid", "use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "filters": 25, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "linear", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "units": 60, "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "class_name": "Activation"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "linear", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "units": 1, "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "sigmoid", "trainable": true, "name": "activation_4"}, "class_name": "Activation"}], "class_name": "Sequential"}